Tekla Open API Reference for Tekla Structures 2025
PolyLine Methods
The PolyLine type exposes the following members.
Methods
Name | Description
Equals
 Returns true if the objects are equal.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns a hash code for a polyline. Notice, in extremely rare cases, you might not get the same hash code for two polylines even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Overrides Object.GetHashCode().)
Length
 Returns the length of a polyline.
Top
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace